<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Diagramas de clases</title>
    <link href="../styles/styles.css" type="text/css" rel="stylesheet" />
</head>
<body>
    <section class="seccion-diagrama-clases">
        <h2 id="uml">
          Diagramas de clases
          <abbr
            title="Lenguaje Unificado de Modelado - Unified Modeling Language"
            >UML</abbr
          >
        </h2>
        <div class="contenido-img-diagrama-clases">
          <img
            src="../images/uml.png"
            alt="Diagrama UML de clases"
            width="500"
            height="250"
          />
        </div>
        <div class="contenido-diagrama-clases">
          <p>
            El Lenguaje Unificado de Modelado
            <abbr
              title="Lenguaje Unificado de Modelado - Unified Modeling Language"
              >UML</abbr
            >
            se ha convertido en el lenguaje de modelado gr&aacute;fico preferido para
            diseñar sistemas orientados a objetos. Utilizamos los diagramas de
            clases de UML para representar visualmente las clases y sus
            relaciones de herencia. Este lenguaje permite a las personas que
            diseñan sistemas de software orientado a objetos utilizar una
            notaci&oacute;n est&aacute;ndar en la industria para representarlos.
          </p>
          <p>
            Repasando, dividimos a los objetos en dos categor&iacute;as: animados e
            inanimados. Los objetos animados est&aacute;n “vivos” en cierto sentido; se
            mueven a su alrededor y hacen cosas. Los objetos inanimados no se
            mueven por cuenta propia. No obstante, ambos tipos de objetos tienen
            cosas en com&uacute;n. Todos tienen atributos (por ejemplo: tamaño, forma,
            color y peso) y todos exhiben comportamientos (es decir, una pelota
            rueda, rebota, se infl a y se desinfla; un beb&eacute; llora, duerme,
            gatea, camina y parpadea; un auto acelera, frena y da vuelta; una
            toalla absorbe agua).
          </p>
          <p>
            Los humanos aprenden acerca de los objetos al estudiar sus atributos
            y observar sus comportamientos. Distintos objetos pueden tener
            atributos similares y exhibir comportamientos similares.
          </p>
          <p>
            El diseño orientado a objetos
            <abbr title="Diseño Orientado a Objetos">(DOO)</abbr> modela el
            software en t&eacute;rminos similares a los que utilizan las personas para
            modelar los objetos del mundo real. Aprovecha las relaciones de las
            clases, en donde los objetos de cierta clase, tienen las mismas
            caracter&iacute;sticas. El
            <abbr title="Diseño Orientado a Objetos">DOO</abbr> aprovecha las
            relaciones de herencia, en donde se derivan nuevas clases de objetos
            al absorber las caracter&iacute;sticas de las clases existentes y agregar
            caracter&iacute;sticas &uacute;nicas para cada objeto. Sin duda un objeto de la
            clase “convertible” tiene las caracter&iacute;sticas de la clase
            “autom&oacute;vil” que es m&aacute;s general, pero el techo se quita y se pone de
            manera espec&iacute;fica.
          </p>
          <p>
            El <abbr title="Diseño Orientado a Objetos">DOO</abbr> ofrece una
            manera natural e intuitiva de ver el proceso de diseño del software;
            a saber, se modelan los objetos por sus atributos, comportamientos e
            interrelaciones, de igual forma que describimos los objetos del
            mundo real. El DOO tambi&eacute;n modela la comunicaci&oacute;n entre los objetos.
            As&iacute; como las personas se env&iacute;an mensajes unas con otras, los objetos
            tambi&eacute;n se comunican a trav&eacute;s de mensajes. Un objeto tipo cuenta de
            banco puede recibir un mensaje para reducir su saldo por cierta
            cantidad, debido a que el cliente ha retirado esa cantidad de
            dinero.
          </p>
          <p>
            El <abbr title="Diseño Orientado a Objetos">DOO</abbr> encapsula (es
            decir, envuelve) los atributos y las operaciones (comportamientos)
            en los objetos; los atributos y las operaciones de un objeto est&aacute;n
            enlazadas &iacute;ntimamente. Los objetos tienen la propiedad conocida como
            ocultamiento de informaci&oacute;n. Esto significa que pueden saber c&oacute;mo
            comunicarse unos con otros a trav&eacute;s de interfaces bien definidas,
            pero por lo general no se les permite saber c&oacute;mo se implementan
            otros objetos; los detalles de implementaci&oacute;n se ocultan dentro de
            los mismos objetos. El ocultamiento de la informaci&oacute;n es
            imprescindible para la buena ingenier&iacute;a de software.
          </p>
        </div>
        <div class="volver-indice">
          <a href="../ghiringhelli-alejandro.html">Volver al &iacute;ndice</a>
        </div>
      </section>
</body>
</html>