<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Qu&eacute; es la programaci&oacute;n orientada a objetos</title>
    <link href="../styles/styles.css" type="text/css" rel="stylesheet" />
</head>
<body>
    <section class="seccion-que-es-poo">
        <h2 id="que-es-la-poo">¿Qu&Eacute; es la Programaci&oacute;n Orientada a Objetos?</h2>
        <div class="contenido-que-es-poo">
          <p>
            Grady Booch, autor del m&eacute;todo de diseño orientado a objetos, define
            la
            <dfn>programaci&oacute;n orientada a objetos <b>(POO)</b></dfn>
            como
          </p>
          <blockquote>
            <q>
              m&eacute;todo de implementaci&oacute;n en el que los programas se organizan como
              colecciones cooperativas de objetos, cada uno de los cuales
              representan una instancia de una alguna clase, y cuyas clases son
              todas miembros de una jerarqu&iacute;a de clases unidas mediante
              relaciones de herencia
            </q>
          </blockquote>
          <p>
            Existen tres importantes partes en la definici&oacute;n: la programaci&oacute;n
            orientada a objetos
            <strong>
              <ol>
                <li>
                  utiliza objetos, no algor&iacute;micos, como bloques de construcci&oacute;n
                  l&oacute;gicos (jerarqu&iacute;a de objetos);
                </li>
                <li>cada objeto es una instancia de una clase, y</li>
                <li>
                  las clases se relacionan unas con otras por medio de
                  relaciones de herencia
                </li>
              </ol>
            </strong>
          </p>
          <p>
            Un programa puede parecer orientado a objetos, pero si cualquiera de
            estos elementos no existe, no es un programa orientado a objetos.
            Espec&iacute;ficamente, la programaci&oacute;n sin herencia es distinta de la
            programaci&oacute;n orientada a objetos; se denomina
            <i>
              programaci&oacute;n con tipos abstractos de datos o programaci&oacute;n basada
              en objetos </i
            >.
          </p>
          <p>
            El concepto de objeto, al igual que los tipos abstractos de datos o
            tipos definidos por el usuario, es una
          </p>
          <strong>colecci&oacute;n de elementos de datos</strong>,
          <p>
            junto con las funciones asociadas utilizadas para operar sobre esos
            datos. Sin embargo, la potencia real de los objetos reside en el
            modo en que los objetos pueden definir otros objetos. Este proceso,
            se denomina herencia y es el mecanismo que ayuda a construir
            programas que se modifican f&aacute;cilmente y se adaptan a aplicaciones
            diferentes.
          </p>
          <p>
            La programaci&oacute;n orientada a objetos trae un nuevo enfoque a los
            retos que se plantean en la programaci&oacute;n estructurada cuando los
            problemas a resolver son complejos. Al contrario de
            <em
              >la programaci&oacute;n procedimental que enfatiza en los algoritmos, la
              POO enfatiza en los datos</em
            >. En lugar de intentar ajustar un problema al enfoque procedimental
            de un lenguaje, la POO intenta ajustar el lenguaje al problema. La
            idea es diseñar formatos de datos que se correspondan con las
            caracter&iacute;sticas esenciales de un problema.
          </p>
          <p>
            <strong>
              <em>
                La idea fundamental de los lenguajes orientados a objetos es
                combinar en una &uacute;nica unidad o m&oacute;dulo, tanto los datos como las
                funciones que operan sobre esos datos. Tal unidad se llama
                objeto.
              </em>
            </strong>
          </p>

          <p>
            Las funciones de un objeto se llaman
            <b>funciones miembro o m&eacute;todos</b>, y son el
            <strong>&uacute;nico medio para acceder a sus datos</strong>. Los
            <b>datos de un objeto</b>, se conocen tambi&eacute;n como
            <strong>atributos o variables de instancia</strong>. Si se desea
            leer datos de un objeto, se llama a una funci&oacute;n miembro del objeto.
            Se accede a los datos y se devuelve un valor. No se puede acceder a
            los datos directamente. Los datos est&aacute;n ocultos, de modo que est&aacute;n
            protegidos de alteraciones accidentales. Los datos y las funciones
            se dice que est&aacute;n encapsulados en una &uacute;nica entidad. El
            encapsulamiento de datos y la ocultaci&oacute;n de los datos son t&eacute;rminos
            clave en la descripci&oacute;n de lenguajes orientados a objetos.
          </p>
          <p>
            Si se desea modificar los datos de un objeto, se conoce exactamente
            cu&aacute;les son las funciones que interact&uacute;an con miembros del objeto.
            Ninguna otra funci&oacute;n puede acceder a los datos. Esto simplifica la
            escritura, depuraci&oacute;n y mantenimiento del programa. Un programa se
            compone normalmente de un n&uacute;mero de objetos que se comunican unos
            con otros mediante la llamada a otras funciones miembro.
            <i
              >La llamada a una funci&oacute;n miembro de un objeto se denomina enviar
              un mensaje a otro objeto</i
            >.
          </p>
          <p>
            En el paradigma orientado a objetos, el programa se organiza como un
            conjunto finito de objetos que contiene datos y operaciones
            (funciones miembro o m&eacute;todos) que llaman a esos datos y que se
            comunican entre s&iacute; mediante mensajes. <br />
          </p>
        </div>
        <div class="volver-indice">
          <a href="../ghiringhelli-alejandro.html">Volver al &iacute;ndice</a>
        </div>
      </section>
</body>
</html>